In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [5]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
s2=pd.Series(['a', 'b', 'c', 1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [7]:
import numpy as np

In [8]:
s3 = pd.Series([np.nan, 10, 30])

In [9]:
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [10]:
index_date = ['2018-10-07', '2018-10-08', '2018-10-09', '2018-10-10']
s4 = pd.Series([200, 195, np.nan, 205], index=index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [11]:
s5 = pd.Series({'국어' : 100, '영어': 95, '수학':90})
s5

국어    100
영어     95
수학     90
dtype: int64

In [12]:
pd.date_range(start='2019-01-01', end = '2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [13]:
pd.date_range(start = '2019/01/01', end='2019.01.07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [14]:
pd.date_range(start = '01-01-2019', end='01/07/2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [15]:
pd.date_range(start='2019-01-01', periods=10)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [16]:
pd.date_range(start='2019-01-01', periods=4, freq='2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [17]:
pd.date_range(start='2019-01-01', periods=4, freq='W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [18]:
pd.date_range(start='2023-10-12', periods=4, freq='W')

DatetimeIndex(['2023-10-15', '2023-10-22', '2023-10-29', '2023-11-05'], dtype='datetime64[ns]', freq='W-SUN')

In [19]:
pd.date_range(start='2023-10-12', periods=4, freq='W-SUN')

DatetimeIndex(['2023-10-15', '2023-10-22', '2023-10-29', '2023-11-05'], dtype='datetime64[ns]', freq='W-SUN')

In [20]:
pd.date_range(start='2019-01-01', periods=4, freq='M')

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30'], dtype='datetime64[ns]', freq='M')

In [21]:
pd.date_range(start='2019-01-01', periods=4, freq='2BM')

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31'], dtype='datetime64[ns]', freq='2BM')

In [22]:
pd.date_range(start='2019-01-01', periods=4, freq='QS')

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [23]:
pd.date_range(start='2019-01-01', periods=3, freq='AS')

DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [24]:
pd.date_range(start='2019-01-01 08:00', periods=10, freq='BH')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

In [25]:
pd.date_range(start='2019-01-01 09:00', periods=10, freq='BH')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

In [26]:
pd.date_range(start='2019-01-01 10:00', periods=4, freq='30min')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [27]:
pd.date_range(start='2019-01-01 10:00', periods=4, freq='30T')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [28]:
pd.date_range(start='2019-01-01 10:00', periods=4, freq='10S')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:00:10',
               '2019-01-01 10:00:20', '2019-01-01 10:00:30'],
              dtype='datetime64[ns]', freq='10S')

In [29]:
index_date = pd.date_range(start='2019-03-01', periods=5, freq='D')
pd.Series([51, 62, 55, 49, 58], index=index_date)

2019-03-01    51
2019-03-02    62
2019-03-03    55
2019-03-04    49
2019-03-05    58
Freq: D, dtype: int64

In [30]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [31]:
data_list = np.array([[10,20,30], [40, 50, 60],[70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [32]:
data = np.array([[1,2,3], [4,5,6], [7,8,9], [10,11,12]])
index_date = pd.date_range('2019-09-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index= index_date, columns = columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [33]:
table_data = {'연도':[2015, 2016, 2016, 2017, 2017],
             '지사':['한국', '한국', '미국', '한국', '미국'],
             '고객 수': [200, 250, 450, 300, 500]}
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

In [34]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [35]:
df = pd.DataFrame(table_data, columns = ['고객 수', '연도', '지사'])
df

   고객 수    연도  지사
0   200  2015  한국
1   250  2016  한국
2   450  2016  미국
3   300  2017  한국
4   500  2017  미국

In [36]:
df.values

array([[200, 2015, '한국'],
       [250, 2016, '한국'],
       [450, 2016, '미국'],
       [300, 2017, '한국'],
       [500, 2017, '미국']], dtype=object)

In [37]:
df.columns

Index(['고객 수', '연도', '지사'], dtype='object')

In [38]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [39]:
s2 - s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [40]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [41]:
s2/s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [42]:
n1 = np.array([1,2,3])
n2 = np.array([4,5,6,7])
# n1 + n2

In [43]:
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10, 10, 20, 30, 40, 50])
s3 + s4

0    11.0
1    12.0
2    23.0
3    34.0
4     NaN
5     NaN
dtype: float64

In [44]:
table_data1 = {'A': [1,2,3,4,5], 'B': [10,20,30,40,50], 'C':[100,200,300,400,500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [45]:
table_data2 = {'A': [6,7,8], 'B': [60,70,80], 'C':[600,700,800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [46]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [47]:
table_data3 = {'봄':[256.5, 264.3,215.9,223.2,312.8],
              '여름':[770.6,567.5,599.8,387.1,446.2],
              '가을':[363.5,231.2,293.1,247.7,381.6],
              '겨울':[139.3,59.9,76.9,109.1,108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']
df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [48]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [49]:
df3.mean(axis = 0)

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [50]:
df3.mean(axis = 1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [51]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [52]:
df3.std(axis =1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [53]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [54]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [55]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [56]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [57]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [58]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [59]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [60]:
df_KTX.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [61]:
df_KTX.tail(2)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [62]:
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [63]:
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [64]:
df_KTX.loc['2013': '2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [65]:
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [66]:
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [67]:
df_KTX['경부선 KTX'][2:5]

2013    42005
2014    43621
2015    41702
Name: 경부선 KTX, dtype: int64

In [68]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [69]:
df_KTX.loc['2016', '호남선 KTX']

10622

In [70]:
df_KTX['호남선 KTX']['2016']

10622

In [71]:
df_KTX['호남선 KTX'][5]

C:\Users\bbong\AppData\Local\Temp\ipykernel_2548\823467365.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_KTX['호남선 KTX'][5]

10622

In [72]:
df_KTX['호남선 KTX'].loc['2016']

10622

In [73]:
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [74]:
df_KTX[['동해선 KTX','전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']]

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

In [75]:
df1 = pd.DataFrame({'Class1':[95,92,98,100],
                   'Class2':[91,93,97,99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [76]:
df2 = pd.DataFrame({'Class1': [87,89],
                   'Class2': [85,90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [77]:
#df1.append(df2)

In [78]:
pd.concat([df1, df2])

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [79]:
#df1.append(df2, ignore_index=True)

In [80]:
pd.concat([df1, df2], ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [81]:
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

   Class1
0      96
1      83

In [82]:
pd.concat([df1, df3], ignore_index=True)

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    99.0
4      96     NaN
5      83     NaN

In [83]:
df4 = pd.DataFrame({'Class3':[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [84]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [85]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'Class1':[95,92,98,100],
                     'Class2': [91,93,97,99]}, index = index_label)
df1a
df4a = pd.DataFrame({'Class3':[93,91,95, 98]}, index=index_label)
df4a

   Class3
a      93
b      91
c      95
d      98

In [86]:
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [87]:
df5 = pd.DataFrame({'Class4':[82, 92]})
df5

   Class4
0      82
1      92

In [88]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [89]:
df_A_B = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                      '제품A':[100, 150, 200, 130],
                      '제품B':[90,110,140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [90]:
df_C_D = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                      '제품C':[112, 141, 203, 134],
                      '제품D':[90,110,140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [91]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [92]:
df_left = pd.DataFrame({'key':['A', 'B', 'C'],'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [93]:
df_right = pd.DataFrame({'key':['A', 'B', 'D'],'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [94]:
df_left.merge(df_right, how = 'left', on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [95]:
df_left.merge(df_right, how = 'right', on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [96]:
df_left.merge(df_right, how='outer', on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [97]:
df_left.merge(df_right, how = 'inner', on='key')

  key  left  right
0   A     1      4
1   B     2      5

In [98]:
%%writefile 'C:\Users\bbong\Desktop\ex\machin\sea_rain.csv'
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Overwriting C:\Users\bbong\Desktop\ex\machin\sea_rain.csv

In [99]:
a=pd.read_csv('C:/Users/bbong/Desktop/ex/machin/sea_rain.csv')
# 위치입력시 \가 아니라 /로 입력할 것!

In [100]:
type(a)

pandas.core.frame.DataFrame

In [101]:
pd.read_csv('C:/Users/bbong/Desktop/ex/machin/sea_rain1_from_notepad.csv', encoding='utf-8')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [102]:
%%writefile 'C:\Users\bbong\Desktop\ex\machin\sea_rain_space.txt'
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Overwriting C:\Users\bbong\Desktop\ex\machin\sea_rain_space.txt

In [103]:
b = pd.read_csv('C:/Users/bbong/Desktop/ex/machin/sea_rain_space.txt')
b

                         연도 동해 남해 서해 전체
0   1996 17.4629 17.2288 14.436 15.9067
1  1997 17.4116 17.4092 14.8248 16.1526
2   1998 17.5944 18.011 15.2512 16.6044
3  1999 18.1495 18.3175 14.8979 16.6284
4  2000 17.9288 18.1766 15.0504 16.6178

In [104]:
b = pd.read_csv('C:/Users/bbong/Desktop/ex/machin/sea_rain_space.txt', sep=' ')
b

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [105]:
pd.read_csv('C:/Users/bbong/Desktop/ex/machin/sea_rain.csv', index_col = '연도')

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [106]:
df_WH = pd.DataFrame({'Weight': [62, 67, 55, 74],
                     'Height':[165,177,160,180]}, index = ['id-1', 'id-2', 'id-3', 'id-4'])
df_WH.index.name='User'
df_WH

      Weight  Height
User
id-1      62     165
id-2      67     177
id-3      55     160
id-4      74     180

In [107]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
id-1    22.773186
id-2    21.385936
id-3    21.484375
id-4    22.839506
dtype: float64

In [108]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
id-1      62     165  22.773186
id-2      67     177  21.385936
id-3      55     160  21.484375
id-4      74     180  22.839506

In [109]:
df_WH.to_csv('C:/Users/bbong/Desktop/ex/machin/save_DataFrame.csv')

In [110]:
!type C:\Users\bbong\Desktop\ex\machin\save_DataFrame.csv

User,Weight,Height,BMI
id-1,62,165,22.77318640955005
id-2,67,177,21.38593635289987
id-3,55,160,21.484374999999996
id-4,74,180,22.839506172839506

In [111]:
df_pr = pd.DataFrame({'판매가격': [ 2000, 3000, 5000, 10000],
                     '판매량': [ 32, 53, 40, 25]}, index = ['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [112]:
file_name='C:/Users/bbong/Desktop/ex/machin/save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=' ', encoding='cp949')

In [113]:
!type C:\Users\bbong\Desktop\ex\machin\save_DataFrame_cp949.txt

제품번호 판매가격 판매량
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25